//--------------------------------------------------------
//模块名称：KEY功能模块                                  
//文件名称：KEY.c                                        
//作    者: 15160200108 邓明明                          
//时    间: 2017.06.08                                     
//说    明：按键相关函数声明以及定义                     
//--------------------------------------------------------
#include "KEY.h"
 
uint8_t choose = 0;

//--------------------------------------------------------
//函数  名：KEY_Init()
//函数功能：按键初始化函数
//入口参数：无
//返回  值：无
//--------------------------------------------------------
void KEY_Init (void)
{
	LPC_GPIO3->DIR = 0x00;
	LPC_GPIO3->IE |= (1<<0);	
	LPC_GPIO3->IS &= ~(1<<0);	
	LPC_GPIO3->IEV &= ~(1<<0);	
	NVIC_EnableIRQ(EINT3_IRQn);	
}

//--------------------------------------------------------
//函数  名：PIOINT3_IRQHandler()
//函数功能：PIO3口中断服务函数
//入口参数：无
//返回  值：无
//--------------------------------------------------------
void PIOINT3_IRQHandler (void)
{
	uint32_t i,x;
	for(i=0;i<2500;i++)	
	for(x=0;x<100;x++);	
	if((LPC_GPIO3->MIS&(1<<0))==(1<<0))
	{
		if(choose==0)	choose=1;	
		else	choose=0;
		LPC_GPIO3->IC = (1<<0);
	}
}



