//--------------------------------------------------------
//模块名称：数码管模块
//文件名称：LED.c
//作    者: 15160200109 赵恩仪
//时    间: 2017.06.09
//说    明：数码管显示
//--------------------------------------------------------

#include "LPC11xx.h"
#include "LED.h"

uint16_t table[12]={0xfc0,0xff9,0xfa4,0xfb0,0xf99,0xf92,0xf82,0xff8,0xf80,0xf90,0xfc6,0xf8e};


//--------------------------------------------------------
//函数  名：delay()
//函数功能：延时
//入口参数：无
//返回  值：无
//--------------------------------------------------------
void delay (void)
{
	uint32_t time;
	for(time=0;time<100;time++);
}

//--------------------------------------------------------
//函数  名：LED_Init()
//函数功能：数码管12只脚配置成输出模式
//入口参数：无
//返回  值：无
//--------------------------------------------------------
void LED_Init (void)
{
	LPC_GPIO2->DIR = 0xfff;
}

//--------------------------------------------------------
//函数  名：LED
//函数功能：4位共阳数码管动态显示4位数字
//入口参数：Num需要显示的数字,mode显示温度的方式10摄氏温度，11华氏温度
//返回  值：无
//--------------------------------------------------------
void LED (uint16_t Num,uint8_t mode)
{
	if(mode==1)
		Num=Num*1.8+32;
	if(Num<10)
	{
		LPC_GPIO2->DATA = table[Num%10];	
		LPC_GPIO2->DATA &= ~(1<<10);		
		delay();
	}
	else
	{
		LPC_GPIO2->DATA = table[Num%100/10];
		LPC_GPIO2->DATA &= ~(1<<9);
		delay();
		LPC_GPIO2->DATA = table[Num%10];
		LPC_GPIO2->DATA &= ~(1<<10);
		delay();
	}
	LPC_GPIO2->DATA = table[mode+10];
	LPC_GPIO2->DATA &= ~(1<<11);
	delay();
}
